Repository: kieutung52/2025_LTTBDD_N02_KieuThanhTung
Catalog: frontend_flutter/lib/l10n/app_*.arb
Languages: vi

# loginButton
source: Login
vi: Đăng nhập

# registerButton
source: Register
vi: Đăng ký

# emailHint
source: Enter your email
vi: Nhập email của bạn

# passwordHint
source: Enter your password
vi: Nhập mật khẩu của bạn

# welcomeMessage
source: Welcome, {userName}!
vi: Chào mừng, {userName}!

# toggleMenuTooltip
source: Toggle menu
vi: Thu/gọn menu

# openMenuTooltip
source: Open menu
vi: Mở menu

# logoutButton
source: Logout
vi: Đăng xuất

# navHome
source: Home
vi: Trang chủ

# navLearn
source: Learn
vi: Học

# navExercise
source: Exercise
vi: Bài tập

# navProfile
source: Profile
vi: Hồ sơ

# navSearch
source: Search
vi: Tra từ

# exerciseResultsTitle
source: Results ({count} exercises)
vi: Kết quả ({count} bài tập)

# noExercisesTitle
source: No Exercises Yet
vi: Chưa có bài tập

# noExercisesSubtitle
source: You haven't completed any exercises on this day.
vi: Bạn chưa làm bài tập nào vào ngày này.

# exerciseCardTitle
source: Exercise #{id}
vi: Bài tập #{id}

# correctAnswersLabel
source: Correct: {correct}/{total}
vi: Đúng: {correct}/{total}

# answerDetailsTitle
source: Answer Details (Date: {date})
vi: Chi tiết câu trả lời (Ngày: {date})

# noDetailsForExercise
source: No details available for this exercise.
vi: Không có chi tiết cho bài tập này.

# yourAnswerLabel
source: You chose: {answer}
vi: Bạn chọn: {answer}

# correctAnswerLabel
source: Answer: {answer}
vi: Đáp án: {answer}

# noExplanation
source: No explanation available.
vi: Không có giải thích.

# exerciseTitle
source: Exercise
vi: Bài tập

# exerciseSubtitle
source: Practice and test your knowledge
vi: Luyện tập và kiểm tra kiến thức của bạn

# createExerciseTab
source: Create Exercise
vi: Tạo bài tập

# resultsTab
source: Results
vi: Kết quả

# errorNoVocabForExercise
source: Error: No vocabulary available to create an exercise.
vi: Lỗi: Không có từ vựng nào để tạo bài tập.

# errorCannotCreateExercise
source: Could not create exercise
vi: Không thể tạo bài tập

# errorCannotGradeExercise
source: Could not grade exercise
vi: Không thể chấm điểm

# vocabExerciseTitle
source: Vocabulary Exercise
vi: Bài tập từ vựng

# vocabExerciseDescription
source: This exercise consists of 10 multiple-choice questions. Choose the best answer.
vi: Bài tập gồm 10 câu hỏi trắc nghiệm về từ vựng. Hãy chọn đáp án đúng nhất.

# startQuizButton
source: Start Quiz
vi: Bắt đầu làm bài

source: Error loading exercise
vi: Lỗi tải bài tập

# questionProgress
source: Question {current}/{total}
vi: Câu {current}/{total}

# previousQuestionButton
source: Previous
vi: Câu trước

# submitButton
source: Submit
vi: Nộp bài

# nextQuestionButton
source: Next
vi: Câu sau

source: Error loading results
vi: Lỗi tải kết quả

source: Result: {score}%
vi: Kết quả: {score}%

# resultSummary
source: You answered {correct}/{total} questions correctly
vi: Bạn trả lời đúng {correct}/{total} câu

source: Answer Details
vi: Chi tiết câu trả lời

# newExerciseButton
source: Start New Exercise
vi: Làm bài tập mới

# noVocabForToday
source: No vocabulary for today.
vi: Không có từ vựng cho hôm nay.

# meaningOfWord
source: Meaning
vi: Nghĩa của từ

# noExample
source: No example available
vi: Không có ví dụ

# learnedProgress
source: Learned: {learned}/{total}
vi: Đã học: {learned}/{total}

# remainingProgress
source: Remaining: {remaining}
vi: Còn lại: {remaining}

# flipCardButton
source: Flip Card
vi: Lật thẻ

# alreadyLearnedButton
source: ✓ Learned
vi: ✓ Đã học

# markAsLearnedButton
source: I Remembered
vi: Đã nhớ

source: Tap to flip
vi: Nhấn để lật

# streakSuccessMessage
source: Streak maintained successfully!
vi: Duy trì streak thành công!

# streakErrorMessage
source: Error updating streak
vi: Có lỗi khi cập nhật streak

# matchingGameTitle
source: Matching Game
vi: Ghép từ

# playAgainButton
source: Play Again
vi: Chơi lại

# noVocabForGame
source: No vocabulary to play.
vi: Không có từ vựng để chơi.

# movesLabel
source: Moves
vi: Số lần thử

# matchedLabel
source: Matched
vi: Đã ghép

# gameCompleteTitle
source: Completed!
vi: Hoàn thành!

# gameCompleteSubtitle
source: You finished the game in {moves} moves!
vi: Bạn đã hoàn thành game với {moves} lần thử!

# learnVocabTitle
source: Learn Vocabulary
vi: Học từ vựng

# flashcardDescription1
source: Learn new vocabulary through flashcards.
vi: Học từ vựng mới qua thẻ ghi nhớ.

# flashcardDescription2
source: Flip the card to see the meaning and example.
vi: Lật thẻ để xem nghĩa và ví dụ.

# startLearningButton
source: Start Learning
vi: Bắt đầu học

# matchingGameDescription1
source: Match English words with their Vietnamese meanings.
vi: Ghép các từ tiếng Anh với nghĩa tiếng Việt tương ứng.

# matchingGameDescription2
source: Fun and effective!
vi: Vui vẻ và hiệu quả!

# playNowButton
source: Play Now
vi: Chơi ngay

source: Login failed: {error}
vi: Đăng nhập thất bại: {error}

# passwordMismatchError
source: Confirmation password does not match
vi: Mật khẩu xác nhận không khớp

# registerSuccessMessage
source: Registration successful! Please log in.
vi: Đăng ký thành công! Vui lòng đăng nhập.

# registerFailedError
source: Registration failed: {error}
vi: Đăng ký thất bại: {error}

# createAccountTitle
source: Create Account
vi: Tạo tài khoản

# fullNameHint
source: Full Name
vi: Họ và tên

# confirmPasswordHint
source: Confirm Password
vi: Xác nhận mật khẩu

# editButton
source: Edit
vi: Chỉnh sửa

# streakStatsTitle
source: Streak Statistics
vi: Thống kê Streak

# currentStreakLabel
source: Current Streak
vi: Streak hiện tại

# streakDays
source: {days} days
vi: {days} ngày

# lastActiveLabel
source: Last Active
vi: Học lần cuối

# currentDateLabel
source: Current Date
vi: Ngày hiện tại

# personalInfoTitle
source: Personal Information
vi: Thông tin cá nhân

# fullNameLabel
source: Full Name
vi: Họ và tên

# saveChangesButton
source: Save Changes
vi: Lưu thay đổi

# cancelButton
source: Cancel
vi: Hủy

# settingsTitle
source: Settings
vi: Cài đặt

# changeLanguageLabel
source: Change language:
vi: Đổi ngôn ngữ:

# profileUpdateSuccess
source: Profile updated successfully!
vi: Cập nhật hồ sơ thành công!

# homeWelcomeMessage
source: Hello, {name}!
vi: Xin chào, {name}!

# homeWelcomeSubtitle
source: Keep learning to maintain your streak.
vi: Hãy tiếp tục học tập để duy trì chuỗi ngày học của bạn.

# consecutiveStudyDays
source: Consecutive Study Streak
vi: Chuỗi ngày học liên tiếp

# streakMessagePositive
source: Awesome! You've studied for {days} consecutive days!
vi: Tuyệt vời! Bạn đã học {days} ngày liên tiếp!

# streakMessageZero
source: Start learning today!
vi: Bắt đầu học hôm nay nhé!

# learnNewVocab
source: Learn New Vocabulary
vi: Học từ vựng mới

# learnNewVocabDescription
source: Learn with flashcards and matching games
vi: Học với flashcard và trò chơi ghép từ

source: Do Exercises
vi: Làm bài tập

# doExercisesDescription
source: Test your knowledge with multiple-choice questions
vi: Kiểm tra kiến thức với các bài trắc nghiệm

# doExercisesButton
source: Do Exercises
vi: Làm bài tập

# searchVocabHint
source: Search for vocabulary...
vi: Tìm kiếm từ vựng...

# errorPrefix
source: Error: {error}
vi: Lỗi: {error}

# examplePrefix
source: Example: "{example}"
vi: Ví dụ: "{example}"

# wordNotFoundTitle
source: Word Not Found
vi: Không tìm thấy từ

# wordNotFoundSubtitle
source: The vocabulary you requested was not found.
vi: Không tìm thấy từ vựng bạn yêu cầu.

# searchDictionaryTitle
source: Dictionary Search
vi: Tìm kiếm từ điển

# searchDictionarySubtitle
source: Enter the vocabulary you want to look up in the box above.
vi: Nhập từ vựng bạn muốn tra vào ô bên trên.
